import React from 'react';
import { Card, Row, Col } from 'antd';
import '../../assets/css/bundle.css';

const { Meta } = Card;

const data = [
    {
        "Название": "С1.020.150.01 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2021/01/c1.020.150.01.p-scaled.jpg",
        "Артикул основы": "С1.020.150.01;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "20 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "14 г/кв.м.;",
            "Поверхностная плотность": "34 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    },
    {
        "Название": "С1.020.150.31 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2021/01/c1.020.150.31.p-scaled.jpg",
        "Артикул основы": "С1.020.150.31;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "20 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "14 г/кв.м.;",
            "Поверхностная плотность": "34 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    },
    {
        "Название": "С1.030.150.01 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2021/01/c1.030.150.01.p-scaled.jpg",
        "Артикул основы": "С1.030.150.01;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "30 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "15 г/кв.м.;",
            "Поверхностная плотность": "45 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    },
    {
        "Название": "С1.030.150.31 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2021/01/c1.030.150.31.p-scaled.jpg",
        "Артикул основы": "С1.030.150.31;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "30 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "15 г/кв.м.;",
            "Поверхностная плотность": "45 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    },
    {
        "Название": "С1.050.150.01 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2021/01/c1.050.150.01.p-scaled.jpg",
        "Артикул основы": "С1.050.150.01;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "50 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "18 г/кв.м.;",
            "Поверхностная плотность": "68 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    },
    {
        "Название": "С1.050.150.31 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2021/01/c1.050.150.31.p-scaled.jpg",
        "Артикул основы": "С1.050.150.31;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "50 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "18 г/кв.м.;",
            "Поверхностная плотность": "68 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    },
    {
        "Название": "С1.080.150.01 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2021/01/c1.080.150.01.t--scaled.jpg",
        "Артикул основы": "С1.080.150.01;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "80 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "20 г/кв.м.;",
            "Поверхностная плотность": "100 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    },
    {
        "Название": "C1(2).030.150.01 (Р)",
        "Изображение": "https://ametist-vlad.com/wp-content/uploads/2020/10/c12.030.150.01.e.jpg",
        "Артикул основы": "С1(2).030.150.01;",
        "Ширина": "150 см;",
        "Длина рулона": "100 м.",
        "Состав": {
            "Полиэфир - 100%": "30 г/кв.м.;",
            "Клей EVA (температура плавления: 105 ÷ 115℃)": "30 г/кв.м.;",
            "Поверхностная плотность": "60 г/кв.м.;",
            "Усадка бытовая": "1 %;",
            "Клеящая способность": "не менее 0,3 кгс/см."
        },
        "Дублирование": {
            "Температура греющей поверхности": "145 ± 5 ℃;",
            "Давление": "0,04 ± 0,01 Мпа;",
            "Время": "20 с."
        },
        "Уход": [
            "Стирка до 60 ℃;",
            "Устойчивость к некоторым видам химчистки."
        ],
        "Применение": "Женская и мужская верхняя одежда: полочка, борт, воротник."
    }
]


function CatalogCard() {
    return (
        <>
            <Row gutter={[16, 16]}>
                {data.map((item, index) => (
                    <Col span={8} key={index}>
                        <Card
                            hoverable
                            cover={<img alt={item.Название} src={item.Изображение} />}
                        >
                            <Meta title={item.Название} />
                            <div style={{ marginTop: '16px' }}>
                                <p><strong>Артикул основы:</strong> {item["Артикул основы"]}</p>
                                <p><strong>Ширина:</strong> {item["Ширина"]}</p>
                                <p><strong>Длина рулона:</strong> {item["Длина рулона"]}</p>
                                <p><strong>Состав:</strong></p>
                                <ul>
                                    {Object.entries(item["Состав"]).map(([key, value], i) => (
                                        <li key={i}>{key}: {value}</li>
                                    ))}
                                </ul>
                                <p><strong>Дублирование:</strong></p>
                                <ul>
                                    {Object.entries(item["Дублирование"]).map(([key, value], i) => (
                                        <li key={i}>{key}: {value}</li>
                                    ))}
                                </ul>
                                <p><strong>Уход:</strong></p>
                                <ul>
                                    {item["Уход"].map((care, i) => (
                                        <li key={i}>{care}</li>
                                    ))}
                                </ul>
                                <p><strong>Применение:</strong> {item["Применение"]}</p>
                            </div>
                        </Card>
                    </Col>
                ))}
            </Row>
        </>
    );
}

export default CatalogCard;
